app/controllers/user_stocks_controller.rb

SELECT  "stocks".* FROM "stocks" WHERE "stocks"."ticker" = $1 ORDER BY "stocks"."id" ASC LIMIT $2  [["ticker", "FB"], ["LIMIT", 1]]
INSERT INTO "stocks" ("ticker", "name", "last_price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["ticker", "GOOG"], ["name", "Alphabet Inc."], ["last_price", "1007.04"], ["created_at", "2018-04-08 16:46:40.239725"], ["updated_at", "2018-04-08 16:46:40.239725"]]
---
  def create
    stock = Stock.find_by_ticker(params[:stock_ticker])
    if stock.blank?
      stock = Stock.new_from_lookup(params[:stock_ticker])
      stock.save
    end
    @user_stock = UserStock.create(user: current_user, stock: stock)

SELECT  "user_stocks".* FROM "user_stocks" WHERE "user_stocks"."user_id" = $1 AND "user_stocks"."stock_id" = $2 ORDER BY "user_stocks"."id" ASC LIMIT $3  [["user_id", 1], ["stock_id", 2], ["LIMIT", 1]]
DELETE FROM "user_stocks" WHERE "user_stocks"."id" = $1  [["id", 2]]
---
  def destroy
    stock = Stock.find(params[:id])
    @user_stock = UserStock.where(user_id: current_user.id, stock_id: stock.id).first
    @user_stock.destroy